{"key":"037jhLD1yXY","title":"Rosetta: 100 Days to Wake-Up - ESA's Comet-Chasing Mission Twelve-Year Journey in Space","description":"11 October 2013 - ESA's comet-chasing mission Rosetta will wake up in 100 days' time from deep-space hibernation to reach the destination it has been cruising towards for a decade. Comets are the primitive building blocks of the Solar System and the likely source of much of Earth's water, perhaps even delivering to Earth the ingredients that helped life evolve. By studying the nature of a comet close up with an orbiter and lander, Rosetta will show us more about the role of comets in the evolution of the Solar System. Rosetta was launched on 2 March 2004, and through a complex series of flybys -- three times past Earth and once past Mars -- set course to its destination: comet 67P/Churyumov--Gerasimenko. It also flew by and imaged two asteroids, Steins on 5 September 2008 and Lutetia on 10 July 2010. In July 2011 Rosetta was put into deep-space hibernation for the coldest, most distant leg of the journey as it travelled some 800 million kilometres from the Sun, close to the orbit of Jupiter. The spacecraft was oriented so that its solar wings faced the Sun to receive as much sunlight as possible, and it was placed into a slow spin to maintain stability. Now, as both the comet and the spacecraft are on the return journey back into the inner Solar System, the Rosetta team is preparing for the spacecraft to wake up. Rosetta mission milestones 2014-2015 Rosetta's internal alarm clock is set for 10:00 GMT on 20 January 2014. Once it wakes up, Rosetta will first warm up its navigation instruments and then it must stop spinning to point its main antenna at Earth, to let the ground team know it is still alive. \"We don't know exactly at what time Rosetta will make first contact with Earth, but we don't expect it to be before about 17:45 GMT on the same day,\" says Fred Jansen, ESA's Rosetta mission manager. \"We are very excited to have this important milestone in sight, but we will be anxious to assess the health of the spacecraft after Rosetta has spent nearly 10 years in space.\" After wake-up, Rosetta will still be about 9 million km from the comet. As it moves closer, the 11 instruments on the orbiter and 10 on the lander will be turned on and checked. In early May, Rosetta will be 2 million km from its target, and towards the end of May it will execute a major manoeuvre to line up for rendezvous with the comet in August. The first images of a distant 67P/Churyumov--Gerasimenko are expected in May, which will dramatically improve calculations of the comet's position and orbit. Closer in, Rosetta will take thousands of images that will provide further details of the comet's major landmarks, its rotation speed and spin axis orientation. ESA: Rosetta: 100 Days to Wake-Up http://www.esa.int/Our_Activities/Spa... ROSETTA MISSION MILESTONES http://spaceinimages.esa.int/Images/2...","publishedDate":"Published on Oct 12, 2013","viewCount":3431,"noOfLikes":30,"noOfDislikes":0,"relatedURL":["/watch?v=J08PuCQChU4","/watch?v=qYIpU0DpZzM","/watch?v=SaHkR1FoQTk","/watch?v=TwkliXod6Ns","/watch?v=yICO-Fy3RQ0","/watch?v=7av-GHKJlFE","/watch?v=1UXwKiO2-vA&list=PLbyvawxScNbtAhH8vHAYl-pyEirPi-4Ad","/watch?v=agB8ewYjprA","/watch?v=0Hf2HYLhnxw","/watch?v=mlXoLwvzhzc","/watch?v=pEZnk2dKUnE","/watch?v=H4MySywo9lw","/watch?v=j2sZ4lHHDC8","/watch?v=Ah4a5-Be9-g","/watch?v=jbiHeq3i0Zs","/watch?v=ELbEG1xPX9s","/watch?v=M42RuLn69MY","/watch?v=Ul8B7Y8a-3A","/watch?v=o0gBoV0ygJc","/watch?v=5NwSm8SULvw","/watch?v=Z278tnjv0Ps","/watch?v=wGjwHhNH49E","/watch?v=qvXFxi2ZXT0","/watch?v=mnlXG4psdBk","/watch?v=oFoK4rUUyuE","/watch?v=5b7u6stKgfs","/watch?v=hlNnxCVx5-U","/watch?v=2wqxGhN6bxU","/watch?v=BUvrwPBSo3A","/watch?v=fNBUep7mPdI","/watch?v=0MPXrzzK-sc","/watch?v=6yGMtvpWup8","/watch?v=KlCCoj2Q9PA","/watch?v=Oq8lEKAY_fI","/watch?v=mL8qfH8NxyE","/watch?v=XEfKq-pQBcc","/watch?v=UeKBtberr_A","/watch?v=V4qXSv64jts","/watch?v=qoIV6G_e0j8","/watch?v=0amr33i45Nk"],"category":"Science & Technology","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT2M6S","channelID":"UClTW8hInWWrvVB-tw1DRWFQ","authorYTURL":"http://www.youtube.com/channel/UClTW8hInWWrvVB-tw1DRWFQ","authorGPlusURL":"https://plus.google.com/112382482891584897940","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}