{"key":"1ZcEf6-7Uw0","title":"Indian Navy's THE KILLERS (Missile Vessel Squadron)","description":"The Indo-Pakistani War of 1971 was a military conflict between India and Pakistan. Indian, Bangladeshi and international sources consider the beginning of the war to be Operation Chengiz Khan, Pakistan's December 3, 1971 pre-emptive strike on 11 Indian airbases. During the course of the war, Indian and Pakistani forces clashed on the eastern and western fronts. The war effectively came to an end after the Eastern Command of the Pakistani Armed Forces signed the Instrument of Surrender, on December 16, 1971 following which East Pakistan seceded as the independent state of Bangladesh. Between 90,000 and 93,000 members of the Pakistan Armed Forces including paramilitary personnel were taken as Prisoners of War by the Indian Army. It is estimated that between 2,000,000 and 3,000,000 civilians were killed in Bangladesh, and four hundred thousand women raped by the Pakistani armed forces. The Indian Navy started the covert naval operations, which were executed successfully. In the end months of 1971, the Indian Navy's Eastern Naval Command had effectively applied a naval blockade which also completely isolated East-Pakistan's Bay of Bengal, trapping the Eastern Pakistan Navy and eight foreign merchant ships in their ports. Operation Trident: On 4 December, the Indian Navy launched a fast naval strike on the Pakistan Naval Headquarters (PNHQ) of Karachi. The task group for the operation consisted of three Vidyut class missile boats, INS Nipat (K86), INS Nirghat (K89) and INS Veer (K82) from the 25th \"Killer\" Missile Boat Squadron, escorted by two anti-submarine Arnala class corvettes, INS Kiltan (P79) and INS Katchall (P81), and a fleet tanker, INS Poshak. At 2230 hrs PST, the task group converged about 70 nautical miles (130 km) south of Karachi detected Pakistani targets, analyzed as warships 45 miles to the northwest and 42 miles to the northeast. INS Nirghat then steered towards and engaged the northwesterly target and after verification, fired the first SS-N-2B Styx missile at the destroyer, PNS Khaibar, which was on patrol. Khaibar mistook the missile to be an aircraft and engaged it with its Bofors anti-aircraft guns. The missile struck Khaibar on the starboard side and exploded below the aft galley in the Electrician's mess deck at about 2245 hrs PST. The ship immediately lost propulsion, plunged into darkness and the No.1 Boiler room exploded, engulfing the ship in thick black smoke. Khaibar sent out an emergency transmission to PNHQ which read \"Enemy aircraft attacked in position 020 FF 20. No 1 Boiler hit. Ship stopped.\" In the panic of the attack, the transmission sent incorrect coordinates of the ship's position, which resulted in delays in rescuing the survivors later. With the target still afloat, at about 2249 hrs, INS Nirghat fired a second missile, which was seen approaching and again engaged with anti-aircraft guns of Khaibar. The missile struck the No.2 Boiler room on the starboard side, sinking PNS Khaibar. At 2320 hours, the minesweeper PNS Muhafiz, was targeted by a Styx missile from INS Veer. The missile hit Muhafiz on the port side abaft the bridge, instantaneously disintegrating the vessel before it could send a transmission to the PNHQ. INS Nipat continuing towards Karachi, locked on to the oil storage tanks of the port from 14 nautical miles (26 km) south of the harbor. It fired two missiles at the tanks. One of the missiles misfired, while the other hit the fuel tanks, which were burnt and destroyed, causing heavy loss. The task force then withdrew back towards Bombay. The operation Trident was also noted for introducing the first ship launched missiles in the region, to the war. Overall, the Indian Navy's missile attack was carefully planned and executed well. The attack achieved complete surprise and was a shock to Pakistan's Armed Forces Command. Operation Trident was considered an enormous success for the Indian Navy with no casualties or damage to the Indian task group,[6] which returned safely back to Indian ports. The success of this operation prompted another successful attack on Karachi on 8 December 1971, known as Operation","publishedDate":"Published on Mar 1, 2012","viewCount":56180,"noOfLikes":227,"noOfDislikes":12,"relatedURL":["/watch?v=G_kP0A60tNA","/watch?v=i0FJ-coOINQ","/watch?v=t8FqfHcvr0c","/watch?v=UNG86VSld3s","/watch?v=SDANKHiZaj8","/watch?v=X8KxISpABqM","/watch?v=2CQbxi8T1Cc","/watch?v=VUNN4uEHLaQ&list=PLEAEC0273604DE370","/watch?v=fK8RztGGOPU","/watch?v=RNP3iWnICPQ","/watch?v=Y2rh8Qn-iwE","/watch?v=j46a6U5MTuo","/watch?v=jrxnRx8TiXc","/watch?v=df7FmZ5ejHw","/watch?v=uASByFNefjo","/watch?v=DA3sUwfGd1o","/watch?v=eJJF3MaUz-0","/watch?v=Xx4jy19C8HA","/watch?v=OTiroCcsbjw","/watch?v=QdQLBp8YW_M","/watch?v=OCAUGeke7kM","/watch?v=stapDyU0LgQ","/watch?v=koJs8KKHHdc","/watch?v=YId6wuuu6W4","/watch?v=zl48bwYBDfA","/watch?v=DWY0uUfsk8s","/watch?v=c5J08TP4aI0","/watch?v=IYDHGjXFqrM","/watch?v=H0VbXs3_Izw","/watch?v=tcyYfaMbYvM","/watch?v=WGvIrHpQD2Y","/watch?v=GvDjHcTeTe8","/watch?v=9fy3XLnWsok","/watch?v=WRgDWMBNGX8","/watch?v=jSeJmlGOsbA","/watch?v=B8NWMt5usvo","/watch?v=iPeEItcREGE","/watch?v=3QPeUX3_qfM","/watch?v=dpqUxh0pJI8","/watch?v=TmhuQqPcOtY"],"category":"News & Politics","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT17M11S","channelID":"UCJFMH53Dup-vmVPnuZ_B3ug","authorYTURL":"http://www.youtube.com/user/buntydagame","authorGPlusURL":"https://plus.google.com/104517349414000271259","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}