{"key":"ELhM3TGma7o","title":"Universe Painted in Light","description":"Check out the unusual visual style in this adaptation of the ground-breaking \"Science on a Sphere\" production, including depictions of Earth. From NASA and NOAA, with additional images from ESA Hubble. We perceive light--we see it—but what we see and what it means are not the same. Without context, detail means nothing. Oh, there are so many factors at play here: what wavelengths of light can we see, how well can our brains take what we see and turn it into something we understand? And also, how do we compare ourselves to the thing we're observing? What tools do we use to help us capture information? How do we turn light into data, data into pixels, pixels into meaning? Start with a planet. For example, Earth. And as long as we're at it, let's tip the Earth to spin properly on its axis. Now, recall our original points of light. Our idea. These are satellites in orbit. Satellites collect data as the Earth rotates beneath them. Think of satellites as paint brushes working in reverse: instead of painting planets with light, satellites collect light reflected from planets below. With enough data we can paint a world. Data that make this image come from instruments on two NASA satellites called AQUA and TERRA. These instruments see the Earth in what we might regard as \"natural color.\" They can also see certain events as they happen. There, splattered like white paint on a blue canvas, something important: Hurricane Katrina. These satellites are only two of many that can see hurricanes. The stripes you see building up come from a unique spacecraft called TRMM. Among the many remarkable things TRMM can do, it can look inside hurricanes like nothing else in the world. See for yourself. TRMM sees the actual body of the beast in three dimensions. Orange and red zones indicate higher rainfall rates. Cloud spires called hot towers drive the storm's greedy grab for energy. The Earth changes. It breathes. And it surprises. Though we live on a planet largely covered by water, we often forget that huge tracts are frozen solid. Let's change the perspective. Ice covers much of the world. The eternally frozen parts are called the Cryosphere. It's the planet's thermostat, and a hydrological warehouse, and in terms of a changing climate, it's the canary in a coalmine. You may live your whole life and never visit these places, but these places will affect your life nonetheless. You know this place. The Moon. Earth's closest neighbor is little more than a beautiful stranger across an airless room. There are mysteries here and answers. And, like love, perhaps, destiny. Back on Earth, day and night change like moods, with points of light pricking the darkness like vaguely remembered dreams. City lights shine into space at night, like ancient campfires, like candles of civilization. No other place beyond the Earth shows signs of life like this, or shows signs of life at all. But we're looking. Before we can find life elsewhere, we need to be good at reading its signs at home first. And on Earth, life is everywhere. This is the living Earth: the biosphere. Phytoplankton bloom in vast oceanic fields. Land plants pulse rhythmically with seasonal growth. Together, these sound the global heartbeat, the pulse of life powered by the sun. The Sun. All energy on Earth comes from the sun. The Moon...the Earth...the Sun: celestial spheres we see and feel everyday. But in our solar neighborhood, there are other places, too. Fabulous places. Mysterious places. As a tourist destination, Mars has an impressive brochure. The longest, deepest canyon in the solar system. A volcano so high it's peak climbs above most of the Martian atmosphere. Nothing like these places exists on Earth. Nothing. This is from a NASA mission called WMAP. If the whole universe were a person, this would be its first baby picture. There are no stars here, no galaxies, certainly no planets. But there is energy. The rest came soon enough, once the new kid could collect herself. This is the universe we see today. It's a lively place. That's a gamma ray burst, spotted by NASA's \"SWIFT\" satellite. These cosmic blasts have long puzzled scientists. They may be stars collapsing in upon themselves, or two densely packed remnants of stars merging together. But in either case, scientists believe they herald the births of black holes. They're the most powerful explosions in the universe after the Big Bang. And they seem to happen all the time, as often as once a day. We look outwards as much as we look inwards, for if there is any certainty in the journey of knowledge it's that travel in any direction can lead to the same destination. We see only what we look for, and in space and on Earth we seek the wisdom to ask the right questions.","publishedDate":"Uploaded on Jul 14, 2010","viewCount":42866,"noOfLikes":603,"noOfDislikes":32,"relatedURL":["/watch?v=FDyszoB0A0c","/watch?v=12eO84E8k18","/watch?v=QRn73BhlDJY","/watch?v=uP-Drk7AQdM","/watch?v=NtBebNNr-hM","/watch?v=5vOU6-1yNZs","/watch?v=kV33t8U6w28","/watch?v=h_IiiEF4rGw","/watch?v=34sEX6VM9sU","/watch?v=b38EUdW_g4k","/watch?v=iNmHuBtF3Ew","/watch?v=--X9zfgZtS0","/watch?v=Qf2m35N3DJU","/watch?v=pV58YptFTK0","/watch?v=yFBgvsDxyGk","/watch?v=_IVqMXPFYwI","/watch?v=uGcDed4xVD4","/watch?v=JgMXPXdqJn8","/watch?v=nNA_fXNUmeQ","/watch?v=28WW4p5KwCg","/watch?v=x_rJKO-ZXeU","/watch?v=7AmyfuJDMlY","/watch?v=WUTY-hJGAMM","/watch?v=s56pxa9lpvo","/watch?v=dVIigCMhCZc","/watch?v=-xJnE2uw6EM","/watch?v=Y5oNwJNdMxY","/watch?v=QUpWCRadIIA","/watch?v=YUTH1ypUWkk","/watch?v=X5zVlEywGZg","/watch?v=zeApJ2nuYmY","/watch?v=RTNZDosUaBY","/watch?v=hgxa_soWutg","/watch?v=vSKAccC_mOQ","/watch?v=PaI6BkDkgvs","/watch?v=kRmXL08DuaI","/watch?v=EPyl1LgNtoQ","/watch?v=mcBV-cXVWFw","/watch?v=9mcc86nGnVU","/watch?v=5laK2JopaVE"],"category":"Science & Technology","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT13M13S","channelID":"UC1znqKFL3jeR0eoA0pHpzvw","authorYTURL":"http://www.youtube.com/user/SpaceRip","authorGPlusURL":"https://plus.google.com/115228229030340907324","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}