{"key":"thHR6kTK1QY","title":"Is Sports Psychology The Missing Ingredient Or Is There More?","description":"http://www.mentaltoughnessstrainer.com Is Sports Psychology The Missing Ingredient? Coaches, parents and athletes around the world, are really coming around to the idea of the importance of mental training in sports. Learning basic sports psychology tools and hiring sports psychologists to work with teams, is getting more and more popular among coaches and schools. There are some commonly taught sports psychology techniques that help improve athletes' mental toughness and confidence. They include things like goal setting, visualization, positive self-talk and developing performance routines. We know from the experience of working with hundreds of athletes at the Mental Toughness Academy, that these techniques are often not enough to overcome serious mental blocks and performance anxiety, that most athletes experience at one time or another in their sports careers. Why is this? It all comes down to the way our mind works. To really understand the mechanics of sports psychology, you first need to understand what happens inside the typical athlete's mind. An athlete, who wants to overcome some mental block that is holding them back in their sport, needs to master two types of thoughts or thinking. The first is the cognitive or conscious mind thinking and the second is the automatic or unconscious mind. The conscious mind makes changes very easily. If you give the athlete's conscious mind some new ways of doing things that makes sense and they believe it will improve his chances of performing better, they easily adopt the new way of thinking and adopt the behaviors needed to make the changes happen. On the other hand, the unconscious mind is not so easily swayed and can actually be quite stubborn. If you have ever experienced a mental block and tried to get \"over\" it, you know this is true. The unconscious mind is like an elephant and the conscious mind is like the rider. An elephant can easily resist whatever the rider wants it to do, but if the rider and the elephant are in sync, then they are unstoppable and can achieve powerful goals together. Typical, sports psychologists do a good job helping the conscious mind, the rider on top of the elephant. They help the athletes, like the rider of an elephant, give directions to the mind of the places they want it to go. That works some of the time, unless the athlete's unconscious mind has some mental block that will hold them back. In our mental toughness training, we dig deeper by teaching the athlete/rider how to communicate with the elephant to get it to go where they want it to go. If you have ever seen an athlete suddenly unable to perform a move they have done 100's of times, like a gymnast suddenly not being able to flip over backwards, you know what I mean. This is where sports psychology is really lacking in helping athletes reach their highest potential. At Mental Toughness Academy, we help athletes discover how to tap into their unconscious performance nervous center! Have you ever heard a coach or commentator say about a brilliant performance: \"He's playing unconscious!\" That what makes for amazing performances. Athletes need to learn to tap into their EMOTIONS so they can communicate with their unconscious mind. The problem with many sports psychology programs is they teach athletes to push down, ignore, or otherwise suppress their emotions thinking they will interfere with their performances. I call this \"military-style\" mental toughness and it works for some athletes some of the time, but definitely not all of the time. Don't get me wrong, the military style of pushing down your emotions definitely has its uses...especially in combat, but it does not work for most athletes, especially kids. The big issue is that it can turn a minor problem into a full-blown mental block that can completely paralyze an athlete. The emotions build up and then they explode at the worst time and place, usually under pressure. The athlete melts down in the middle of a big game from feelings of fear and stress. The quickest and most effective way to overcome anxiety is to embrace and ultimately master your emotions. This is the core of what I teach in our mental toughness trainings at the Academy. I believe mental toughness is when you are focused, confident, determined and resilient, especially under pressure. Sports psychology seems most effective at improving focus, but remember the elephant is in charge of the rest. We can help you be in charge! Go to http://www.sportsmentaltoughness.com to learn more about how to dominate your sport and build unstoppable confidence.","publishedDate":"Published on Jun 10, 2012","viewCount":4229,"noOfLikes":14,"noOfDislikes":1,"relatedURL":["/watch?v=tIsgFvAAgNo","/watch?v=LCPgvTRftZg","/watch?v=VmbIuisw41I","/watch?v=bt1xZ540Q7s","/watch?v=TBgxjhhm-14","/watch?v=aOShjH60tZo","/watch?v=iZNBkLW5EvY","/watch?v=kIIqxYJX_I4","/watch?v=NjZE4sOzvco","/watch?v=z4Bm06_L1RM","/watch?v=yG7v4y_xwzQ","/watch?v=esPRsT-lmw8","/watch?v=1akg5srwmTQ","/watch?v=C1K1ySWCS6s","/watch?v=1v3lZCtRuW8","/watch?v=wNJMKaYHW1s","/watch?v=-gGsePMjtOE","/watch?v=jXx-nb12aFQ","/watch?v=3jT_q7dt-cM","/watch?v=tUShaG9ygBM","/watch?v=Ju4FojRkEKU","/watch?v=ci4pdAgRgVg","/watch?v=4xAGfitT04o","/watch?v=oqf6Ysuxyb8","/watch?v=R206l8-lzSE","/watch?v=0kX5EEo3zuw","/watch?v=jl5Io360bFw","/watch?v=RGyrfpqn2EI","/watch?v=d9NYiJOPZ8U","/watch?v=9tadrWSvjM0","/watch?v=hwHX2zKrmNg","/watch?v=O79S2QuE2dY","/watch?v=6ARKthyuQtA","/watch?v=d8DSzLpEru0","/watch?v=mB5EleInFBc","/watch?v=Vqew1aR1BqA","/watch?v=kJBLEPMcX2s","/watch?v=07ziX2wguQw","/watch?v=58zyMXmpwsM","/watch?v=tfP2qBiwaZI"],"category":"Sports","licence":"Creative Commons Attribution license (reuse allowed)","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT6M17S","channelID":"UCyFd0zjFGQcn4sc2osQKSlw","authorYTURL":"http://www.youtube.com/user/mentaltoughnesstips","authorGPlusURL":"https://plus.google.com/107979107574924955559","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}