{"key":"lPON5FSDHkk","title":"10-Hour | Epic Music Mega Mix Vol. 3","description":"Enjoy the 3000th video. :) List: Intro Music: Peter Gundry - The Prime Cronus Audiomachine - Legends of Destiny Immediate Music - Journey To The Front Two Steps From Hell - Orion Brand X Music - Into The Abyss Epic Score - Something to Believe In Fired Earth Music - The Other World Future World Music - Promenade West One Music - Hereafter Ninja Tracks - Black Mask Nick Phoenix - Rise Of The Father Position Music - Aurora Falling Killer Tracks - One Destiny Thunderstep Music - Star Nomad KPM Music - A Hero is Born Axl Rosenberg Music - Fox Hunter Audiomachine - Charging the Keep MythFox - Time to Come Cavendish Trailers - Games of Power BrunuhVille - Rise of the Fallen ADN Compositions - I Will Rise Arn Andersson - Hope Ethos Music - Phoenix Rising Adrian von Ziegler - Fear No Darkness Epic Score - Gloria Sonus Florian Bur - Welcome to My World Hafiz Hais - Journey Goran Dragaš - Breaking Point Cristian Onofreiciuc - Awakening Clarence Yapp - Path to Victory Clearspeaks Music - Uprising Audiomachine - Judge and Jury Brand X Music - Razorblades Gold Delirium Music - Armada Cavendish Trailers - Will To Survive Audio Network - Trail of Destiny Xiphon Audio - The Fight Will Be Your Own switch. Trailer Music - Lift the Atmosphere (ft. Juliet Lyons) Kyueko - A Lion's Heart Guy-Roger Duvert - One Against All Crystal Strings - A Hero's Legacy Axl Rosenberg - Ascendance Two Steps From Hell - Rebirth Cavendish Trailers - A Hero Emerges Ethos Music - Nothing Left To Lose DYATHON - Doomed To Death Hundred Days Music - Exodus Heavy Melody - Falling Horizons Future World Music - Follow Your Dream BrunuhVille - Tales of Ice and Blood Paradox Music - Nomad ATLAS - Hariesis DYATHON - Remember Me Audiomachine - Destination Earth Clearspeaks Music - The Undefeated DeVso Music - When All Hope Is Lost DJ La Mano - Flight of the Dragon Alexandros Nikolaidis - Extinction Epic Score - Legends Remembered Gareth Meek - Zero Mosaique - Rise Again And Again Immediate Music - A Life Extraordinary Guy-Roger Duvert - The Siege of Fort Torental Fired Earth Music - Divinity Drew Petersen - Retribution Crystal Strings - Bloom Axl Rosenberg - Into The Wild Cristian Onofreiciuc - Destiny Gold Delirium Music - This Is My Destiny Killer Tracks - Battle the Heavens James Paget - Together As One Mark Pride - Dragons Rising Ninja Tracks - Vengenace Position Music - Reap What We Sow Phil Rey - Dragon Master Kyueko - Flames of Hell György Péter - Battle of Realms DYATHON - Skyline Boris Mihajlovic - Glory to the Jaegers Hundred Days Music - Ring Out Joachim Heinrich - Resistance Joachim Heinrich - Revelation K-FaZa Beats - Light Nexus3Music - Serenity Dylan Jones - Tide TheOfficial Karian - Paragon Cengizhan Yavuzer - Feel The Power Ryan Combstock - Love & Beauty Nexus3music - I'm Fine Jason Oakland - Emotional HundredDaysMusic - Warlord John Boberg - Guardian Watch Mattia Turzo - Fight of Glory MPLAY - New Beginning Ivan Torrent - One Of Us (feat. Julie Elven) Emid Scores - Confession Arvenas - Remember The Fallen Nightcall - Dead V D&D - Salvation Asith Perera - Hidden Hope DYATHON - Dark Knight Lucas King - Rising Boris Mihajlovic - New Era (Ft. Alexandre Guiraud) Iani M.D. - Dreams ADN Compositions - Primarch Alexandros Nikolaidis - Gate of Hades BrunuhVille - Rebirth Audiomachine - No Return DeVso Music - Leave Us Alone DYATHON - Adrift Kyueko - Bifröst KPM Music - This Defines You Future World Music - Touch of Light Bausic Productions - Endless Adventure Epic Score - Phantom Pain RipTide Music - Guardians Of Minaria Really Slow Motion - Aeorien Phil Rey - Lion Heart Paradox Music - Run Goran Dragaš - Hell is For Heroes Arn Andersson - Annihilation Audiomachine - The Future Is Upon Us Axl Rosenberg - Spiro Immediate Music - Rise Of The Chosen Aran Zayne - A Lenged is Born Adriael - Dynasty Of The Dragon Aniruddh Immaneni - The Awakening Arvenas - Serenity Natanel Arnson - A Hero Will Rise Nexus3Music - Fiend inside me Kevin Mantey - Ultraterrestial Forces K-FaZa Beats - Aliens Jonathan Mayer - Retaliation Robert Schroeder - Ararat Theron Kay - Blizzard StormSound - It's Time Instrumental Core - Let There Be Light Dustin Krizan - March Of Saints D&D - Giants Boris Mihajlovic - Run Alex Pfeffer - Don't Sleep (feat. Amelia Brightman) Aei - Symphony Of Sadness Aran Zayne - Orion DYATHON - Mistakes Thomas Bergersen - Cry Thunderstep Music - We Need Him Tom Evans - It's What We Make Of It... James Paget - Fly Again Audiomachine - The End Is Near Remaining Tracks: http://pastebin.com/D9sZQQcf Note:- I'm not the creator of this Music or Image, All rights belongs to respective owners. Feel free to Message me if you know the original Image Artist. This video is purely fan-made, it's done for entertainment purposes only. Have Fun! Tags: Epic Music, Trailer Music, Theme Music, Production Music","publishedDate":"Published on Jun 11, 2014","viewCount":244981,"noOfLikes":2635,"noOfDislikes":36,"relatedURL":["/watch?v=jeuzYv9K3BM","/watch?v=lPON5FSDHkk&list=RDlPON5FSDHkk","/watch?v=sG3bOdqnYHk","/watch?v=iGEOu5Cp8sc","/watch?v=lP0D5u3EMfA","/watch?v=aItrMzaMxe0","/watch?v=EX1I2LI8Wc8","/watch?v=b36XKTNtZ3Q","/watch?v=Lmb2Xc-3rXg","/watch?v=DeXoACwOT1o","/watch?v=qYNH1baA_7k","/watch?v=Ym8JjY4fy-M","/watch?v=SEKELU-F9S4","/watch?v=JfInr_A3IhE&list=PL9139CD3D59F796C9","/watch?v=avyz2ehN_6A","/watch?v=fXGOHb6r204","/watch?v=IfTuvH8j8mo","/watch?v=WU7SGn0MeP0","/watch?v=XFQc6EoaK_k","/watch?v=m_isAVgI3KE"],"category":"","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT604M3S","channelID":"UC4L4Vac0HBJ8-f3LBFllMsg","authorYTURL":"http://www.youtube.com/user/ThePrimeCronus","authorGPlusURL":"https://plus.google.com/111634096672363554618","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}