{"key":"2zNSgSzhBfM","title":"MACKLEMORE & RYAN LEWIS - CAN'T HOLD US FEAT. RAY DALTON (OFFICIAL MUSIC VIDEO)","description":"Macklemore & Ryan Lewis present the official music video for Can't Hold Us feat. Ray Dalton. Can't Hold Us on iTunes: https://itunes.apple.com/us/album/can... The Heist CD deluxe edition: http://www.macklemoremerch.com The Heist digital deluxe on iTunes: https://itunes.apple.com/us/album/the... The Heist on Amazon: http://amzn.com/B00908DDZM The Heist in-stores NOW! Note from Ryan Lewis: It seems like when a music video comes out, the title that receives all of the credit and travels with a film is that of the director. It's as though the director is the \"artist\" or \"creator\" of the music video, when in reality a music video is first a written treatment, produced (putting together ingredients like actors and locations), shot and directed, cut on the editing board and finally color graded. The music might be fine tuned and scored specifically for that film. There are so many variables that are completely equal if not sometimes more complicated than directing, it's a shame that so much credit comes down to whoever fulfills that position. A director wouldn't have shit to direct without a producer. A producer would have nothing to produce without a writer, and so forth. For our team, I think it's even more complicated because roles tend to cross over. We simply don't work within the conventional hierarchy of the film industry (director, producer, etc.) Sure, people have concrete pre-defined roles based on their expertise, but our team has the remarkable ability to wear multiple hats. Can't Hold Us was a video that showcased this well. After three months of shooting, finally getting to those last few frames where you reveal the credits, it's a tense moment. There isn't exactly a sensible way to do it, if we're trying to fit people into classic film roles. It leads me to the point that although we do our best to give people titles, this was a video fully created by seven individuals at the forefront. Take any of those people out of the equation, you'd be watching a very different video. I write this in hopes that you don't fall under the illusion that one person creates a music video, particularly at the Macklemore camp. We are constantly challenging and enhancing each others ideas and I take pride in believing that's the reason we make great videos. - Ryan Lewis Music Video: Written By Ben Haggerty Ryan Lewis Tricia Davis Directed By Ryan Lewis Jason Koenig Jon Jon Augustavo Produced By Tricia Davis Honna Kimmerer Jenny Koenig Starring Ben Haggerty Ryan Lewis Ray Dalton Owuor Arunga Da Kadu Brown Director of Photography Jason Koenig Ryan Lewis Mego Lin Stedicam Operators Chris Duerkopp Rhys Duncan Ant Ireland Alex Kornreich Production Assistants Linda SImonsen Jackie Ganger Edward Tran Adam Leeman Nic Adenau Johnny Valencia Ben Campofreda Seth McDonald Mitchell Overton Lei Tao Editing & Color Grading Ryan Lewis Jason Koenig Post Production Supervisor Erik Hustad Special Thanks RED Panavision Victory Studios Koerner Camera Space Needle Ryan Sanson Lady Washington Logan Neitzel Sierra Blu Kennels USC FIJI House Niche Camera Karen Stimwell & Co. Hollywood Props, Auckland Helicopters Northwest Niche Camera Oppenheimer Absolute Technologies Court in the Square First Scene Costume, Auckland Painted Camels Unlimited Graeme Menzies Colin McKay Daniel Cooper Mercury Bay Aero Club Whitianga Charters Dylan Henderson Jason Bosch Kyle Bosch Hollywood Animals Michael Barrett/United Reprographics Peter Pathe Music: Can't Hold Us feat. Ray Dalton (B. Haggerty, R. Lewis, R. Dalton) Macklemore Publishing BMI, Ryan Lewis Publishing BMI Produced by Ryan Lewis for Macklemore DBA Ryan Lewis LLC Written by Macklemore Additional Vocals by Ray Dalton, Camila Recchi, Victoria Fuangaromya, Tyler Andrews Trumpet by Owuor Arunga Trombone by Greg Kramer Violin, Bells, and String Arrangement by Andrew Joslyn Violin by Caroline Faflak Violin by Jared MacFarlane Viola by Elisa Clegg Cello by Danah Olivetree Cello by Natalie Mai Hall Recorded and Mixed by Ryan Lewis, Ben Haggerty Macklemore/RyanLewis Studios, Seattle, WA Mastered by \"Big Bass\" Brian Gardner, Hollywood, CA Url's: http://www.macklemore.com http://www.twitter.com/macklemore http://www.twitter.com/ryanlewis http://www.facebook.com/macklemore http://www.facebook.com/ryanlewisprod... Subscribe To The Channel: goo.gl/1UmcM Macklemore & Ryan Lewis managed by Zach Quillen Can we go back, this is the moment Tonight is the night, we'll fight till it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us","publishedDate":"Published on Apr 17, 2013","viewCount":254380684,"noOfLikes":1336310,"noOfDislikes":42496,"relatedURL":["/watch?v=2zNSgSzhBfM&list=RD2zNSgSzhBfM","/watch?v=8PLifPUIuic","/watch?v=QK8mJJJvaes","/watch?v=hlVBg7_08n0","/watch?v=Vhf5cuXiLTA","/watch?v=EHkozMIXZ8w","/watch?v=47dtFZ8CFo8","/watch?v=YxIiPLVR6NA","/watch?v=kYtGl1dX5qI","/watch?v=5jlI4uzZGjU","/watch?v=uuZE_IRwLNI","/watch?v=hT_nvWreIhg","/watch?v=5dbEhBKGOtY","/watch?v=VA770wpLX-Q","/watch?v=1y6smkh6c-0","/watch?v=LrUvu1mlWco","/watch?v=AtKZKl7Bgu0","/watch?v=ktvTqknDobU","/watch?v=mWRsgZuwf_8","/watch?v=IcrbM1l_BoI","/watch?v=3O1_3zBUKM8","/watch?v=CevxZvSJLk8","/watch?v=5NV6Rdv1a3I","/watch?v=RBumgq5yVrA","/watch?v=AByfaYcOm4A","/watch?v=gAg3uMlNyHA","/watch?v=CGyEd0aKWZE","/watch?v=1w9DiGlZksU","/watch?v=gCYcHz2k5x0","/watch?v=DGIgXP9SvB8","/watch?v=KrVC5dm5fFc","/watch?v=yyDUC1LUXSU","/watch?v=KQ6zr6kCPj8","/watch?v=CfihYWRWRTQ","/watch?v=hvNQWQSwmow","/watch?v=mk48xRzuNvA","/watch?v=hj8ZOXtYRwo","/watch?v=nlcIKh6sBtc","/watch?v=1wYNFfgrXTI","/watch?v=cmSbXsFE3l8"],"category":"Music","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT7M4S","channelID":"UCXYRdIXDdeZIf816EWAr5zQ","authorYTURL":"http://www.youtube.com/user/RyanLewisProductions","authorGPlusURL":"https://plus.google.com/114314719715995788431","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}