{"key":"0-p8F4Whj_w","title":"The Weeknd - The Trilogy (Medley) by SoMo","description":"Pre-Order my DEBUT ALBUM \"SoMo\" on iTunes NOW! Get \"SoMo\" & \"Hush\" here: https://itunes.apple.com/us/album/som... Buy The Weeknd's \"Trilogy\" on iTunes here: http://tinyurl.com/by2nacz LIKE AND FOLLOW ME! http://www.facebook.com/OfficialSoMo http://www.twitter.com/OfficialSoMo Our most requested song ever. This is our take on The Weeknd's three awesome mix-tapes - sampling my favorite lyrics from some of his songs! BIG UPS: To Jeremy Brookover and Danny Raybon for the video! LIKE AND FOLLOW! http://www.facebook.com/EvenyreStudios www.facebook.com/BrookoverProductions Vocals: Joseph SoMo Musical Arrangement and Production: Cody Tarpley Video Production: Jeremy Brookover & Danny Raybon I do not own the lyrics used in this song and no copyright infringement was intended. Lyrics: (Lovin The Crew) Take your nose off my keyboard What you bothering me for There's a room full of singas What you following me for This ain't a fucking singalong So girl what you singing for It's cuz we're blowing like a C4 Got my whole crew blowing like a C4 (The Loft) They see my brain melting And the only thing I tell em Is that I'm living for the present And the future don't exist So baby take your clothes off A chance like this  You may never get to show off Show off, show off but tonight  (Wicked Games) I left my girl back home I don't love her no more And she'll never fucking know that These fucking eyes that I'm staring at (High For This) You don't know what's in store But you know what you're here for Close your eyes Lay yourself beside me (Next) You just want me 'cuz I'm next You just want me 'cuz I'm next, baby You just want me 'cuz I'm next (The Birds Part 1) So don't you fall in love with a singa like me like me Don't make me make you fall in love With a singa like me like me (The Initiation) I got a test for you You say you want my heart Well baby you can have it all There's just something I need from you Is to meet my boys I got a lot of boys And we can make you right And if you get too high then (High For This) Open your hand Take a glass Don't rbe scared I'm right here Even though you don't roll Trust me girl You wanna be high for this (Rolling Stone) Getting faded too long Got me on this rolling stone So I take another hit Kill another serotonin With a hand full of beans And a chest full of weed Got me singing bout a bitch While I'm blowing out my steam Yea I know I got my issues Why you think I fuckin' flow? And I'ma keep on smoking 'til I can't hit another note (The Morning) Oh but until thennn I'm thinking all that money the money is the motive All that money the money she be folding Girl put in work girl girl put in work Girl put in work (The Fall) I got show money baby I wanna show you how I blow money baby I wanna show you how I throw money baby I'm a kid, so it's hard for me to hold money, baby (The Knowing) I swear it's okay Cause I know everything I know everything (Same Old Song) Bet you miss me now baby bet you'd kiss me now baby.. But now you're the same old song You're the same old song","publishedDate":"Published on May 25, 2012","viewCount":4524866,"noOfLikes":32584,"noOfDislikes":1220,"relatedURL":["/watch?v=0-p8F4Whj_w&list=RD0-p8F4Whj_w","/watch?v=55Dfz3rdoyg","/watch?v=T2Mc-wUY8JY","/watch?v=s2b6o6E7pAY","/watch?v=dB1qckdh0FE","/watch?v=NEx9khD5HDA","/watch?v=-b8IofvnWps","/watch?v=qip82UVaEG4","/watch?v=h_RkrepJyC4","/watch?v=26fJC-hBYkU","/watch?v=B9i-47ChP_g","/watch?v=5082NM1H-io","/watch?v=926thtbQT1I","/watch?v=fx4MFoZl3Uc","/watch?v=m-RqbuGBBTQ","/watch?v=2A85xBaLYWc&list=PL8Go-YHXcY4bnSo0BDjYt9KuW9izuBD8U","/watch?v=ElYADN1C5Bg","/watch?v=n1YOlYZLDiM","/watch?v=0b762FjAL8Q","/watch?v=IyhytVbu0d4","/watch?v=x7blwVB9L9E","/watch?v=WBGbYagI6G4","/watch?v=a2ZTF8y3I9c","/watch?v=KHiJ-Qzdve8","/watch?v=lvVFCxtnvuM","/watch?v=NFUwjdALmcQ","/watch?v=TAWaYQLWpwU","/watch?v=FZcEPLVLFK8","/watch?v=PyFKDJ5bfcY","/watch?v=Vi9de5bE77c","/watch?v=-_h92B-4ZeI","/watch?v=2A85xBaLYWc","/watch?v=o9PuAm7d0PA","/watch?v=EcTt5GML470","/watch?v=pZWDN6xFX2c","/watch?v=OT4lWbpLGNA","/watch?v=P_rpDHvAt88","/watch?v=OPbGrK3Hw84","/watch?v=imQO4V4jDhI","/watch?v=s7JD3kKtHqo"],"category":"Music","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT6M14S","channelID":"UChJciK7-JLeC0-uPRmFy5BQ","authorYTURL":"http://www.youtube.com/user/TheMrSoMo","authorGPlusURL":"https://plus.google.com/102412347620921776884","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}