{"key":"LCqqAs4al00","title":"Damian Marley - One Loaf Of Bread (Something For You) Official Video","description":"Lyrics: Christ feed the multitude wid only one loaf a bread [x2] Christ feed the multitude wid only one loaf a bread! Poor people There is something for you dont let the pressures of the system Get upon ya head, Poor people there is something for you Mankind cares not for his sisters anymore, still there is something for you Writen in the the book of live we shall live forever more, There will be something for... Rasta works a manifest an it a blossom an a bloom, Nature always run it course the tide is rising wit the moon, It only take a spark to put a fyah to da fume, What is hidden in the dark shall be revealed so very soon, Tell Pharoah free the prisoners from the dungeon an the doom, Tell di youths fi natty-dread an babylon put dem inna platoon, Di trials an di perils deepa dan di blue lagoon, Dem nuh wan fi nuh dem history yuh nuh see say dem a goon Christ fed the multitude wid only one loaf a bread! Poor people There is something for you dont let the pressures of the system Get upon ya head, Poor people there is something for you Mankind cares not for his sisters anymore, still there is something for you! Each an every time yuh see we forward offa tour, there will be something for... Jah gave Moses 10 commandments upon two tables of stone, Led Israel out of Egypt an den promise them a home, Samson slew the Philisteens wid a donkey jaw bone, An david slew goliath wid a two two wey crome, Blessed be da man wey walketh not inna de war zone, Blessed be di man wey hair natty nappy an grown, blessed be di herbs Wey keep we higher, nappy an stone, Fyah fi a man wey se'dung inna Babylon throne, curious woman go a dance an lef dem pickney dem alone, Cannot tek care off ya'self de gidian ready nuh roam, Population unda pressure still dem have more man a clown, An always tell dat which has been lost has not been found. Christ fed the multitude wid only one loaf a bread! Poor people There is something for you dont let the pressures of the system Get upon ya head, Poor people there is something for you Mankind cares not for his sisters anymore, still there is something for you! Written in the book of life we shall live forever more..still there is something.. (Aye) Christ feed the multitude wid only one loaf a bread [x3]","publishedDate":"Uploaded on Aug 27, 2008","viewCount":1132210,"noOfLikes":3631,"noOfDislikes":33,"relatedURL":["/watch?v=LCqqAs4al00&list=RDLCqqAs4al00","/watch?v=b-OeEE6JD8s","/watch?v=tXFpJrlgd7A&list=PL4BF386A76EBE173A","/watch?v=w7RFUcZiWnA","/watch?v=61mkMSZtZcA","/watch?v=5xbmxQlghsY","/watch?v=FOs4iT_I9eU","/watch?v=1s7_BC2yujc","/watch?v=NTbpS5OWWaQ","/watch?v=TGMAgwSlTdM","/watch?v=Ti30A6jB5bI","/watch?v=kZQHS6Cj-Wc","/watch?v=3rEkN2klsMY","/watch?v=dnngqg75rUg","/watch?v=YsunfX4FwHM","/watch?v=M79KsXmsvec","/watch?v=a422R4h2bPM","/watch?v=7Y6ihWvymwg","/watch?v=Xda02V8KLzU","/watch?v=HT2789urycI","/watch?v=IBGYRtVqVSM","/watch?v=c9VQye6P8k0","/watch?v=Dw8ZS9hVGW8","/watch?v=0jgtn5ENojY","/watch?v=_GZlJGERbvE","/watch?v=LqWI0v_QS7o","/watch?v=Q_o6eX4Y5Tw","/watch?v=tXFpJrlgd7A","/watch?v=K-6Qx8yIKC8","/watch?v=keuA3xuB8IU","/watch?v=5yKMLaqxZWs","/watch?v=YCbDq4ia2Q8","/watch?v=IxejaKtf-Zs","/watch?v=VJMTVD9rHDQ","/watch?v=PR_u9rvFKzE","/watch?v=ngfiDVr495w","/watch?v=Z0CfZSj23o8","/watch?v=BGpzGu9Yp6Y","/watch?v=OMGd3mAfl-0","/watch?v=Fo04romxjGo"],"category":"Music","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT3M19S","channelID":"UCBKi1la8bPRoYY3ut0QHEow","authorYTURL":"http://www.youtube.com/user/deano4liv4ever","authorGPlusURL":"https://plus.google.com/114416696681986074383","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}