{"key":"NTbpS5OWWaQ","title":"Damian Marley - Road To Zion (Feat. Nas)","description":"Damian Marley with his song \"Road To Zion\" Subscribe! https://www.youtube.com/watch?v=75Y0z... Arist - Damian Marley (Feat. Nas) Album - Welcome To Jamrock Song - Road To Zion Year - 2005 Lyrics: Yeah Man... Jah will be waiting there, We a shout! Jah will be waiting there [Verse 1] In this world of calamity Dirty looks and grudges and jealousy And police weh abuse dem authority Media clowns weh nuh know 'bout variety Boom! The youngest veteran a go murder dem slow Ragga muffin sent to call me from the bush bungalow Unnu watch mek I clear out my voice now Figaro! Emerge from the darkness with mi big blunt a glow Mi hammer dem a slam and spectator get low Some bwoy coulda big like Bam Bam Biggalow Bust of trigger finger, trigger hand and trigger toe A two gun mi have mi bust dem inna stereo Cause [Hook] I got to keep on walking on the road to Zion, man We gots to keeps it burning on the road to Zion, man [Chorus 1] Clean and pure meditation without a doubt Don't mek dem take you like who dem took out Jah will be waiting there we a shout Jah will be waiting there! In this world of calamity Dirty looks and grudges and jealousy And police weh abuse dem authority Media clowns weh nuh know bout variety Single parents weh need some charity Youths weh need some love and prosperity Instead of broken dreams and tragedy By any plan and any means and strategy [Hook] Say! We got to keep on walking on the road to Zion, man (Nas: I've been waiting to do this track with you man! Yeah...ha ha) (Yeah, yeah) You know (They know) We got to keep on walking on the road to Zion, man (Yeah you gotta keep walking y'all, You gotta keep...) [Nas] Sometimes I can't help but feel helpless I'm havin daymares in daytime Wide awake try to relate This can't be happenin like I'm in a dream while I'm walkin Cause what I'm seein is haunting Human beings like ghost and zombies President Mugabe holding guns to innocent bodies In Zimbabwe They make John Pope seem Godly Sacrilegious and blasphemous In my lifetime I look back at paths i've walked Where savages fought and pastors taught Prostitutes stomp in high heel boots And badges screaming,\"Young black children stop or I will shoot!\" I look back at cooked crack Plus cars that pass by Jaguars mad fly And I'm guilty for materialism Blacks is still up in the prison Trust that So save me your sorries, I'm raising an army Revolutionary warfare with Damian Marley We sparkin' the ions, marching to Zion You know how Nas be NYC state of mind I'm in [Verse 1 Repeats] [Hook] I got to keep on walking on the road to Zion, man We gots to keeps it burning on the road to Zion, man Clean and pure meditation without a doubt Don't mek dem take you like who dem took out Jah will be waiting there we a shout Jah will be waiting there! [Chorus 2] Clean and pure meditation without a doubt Don't mek dem take you like who dem took out Jah will be waiting there we a shout Jah will be waiting there! In this world of calamity Dirty looks and grudges and jealousy And police weh abuse dem authority Media clowns weh nuh know bout variety Single parents weh need some charity Youths weh need some love and prosperity Instead of broken dreams and tragedy By any plan and any means and strategy Instead of broken dreams and tragedy Youths weh need some love and prosperity Instead of broken dreams and tragedy By any plan and any means and any strategy Ay! say, [Hook] I got to keep on walking on the road to Zion, man You know... We got to keep on walking on the road to Zion, man","publishedDate":"Uploaded on Dec 19, 2010","viewCount":17705398,"noOfLikes":61713,"noOfDislikes":1300,"relatedURL":["/watch?v=NTbpS5OWWaQ&list=RDNTbpS5OWWaQ","/watch?v=KvMXuzrOM4c","/watch?v=sVR1UjMw3Js","/watch?v=yV0PYiDhwZo","/watch?v=DqsL46UUWmk","/watch?v=xlCmQcRPtRg","/watch?v=keuA3xuB8IU","/watch?v=_GZlJGERbvE","/watch?v=1iBm60uJXvs","/watch?v=K69A1lL1PHQ","/watch?v=HT2789urycI","/watch?v=c9VQye6P8k0","/watch?v=TpugpzsQgus","/watch?v=zVim3go8kso","/watch?v=wNbWSExg47Y","/watch?v=NW55FRXlPEs","/watch?v=_GZlJGERbvE&list=PL17DA6C413CAA4ACC","/watch?v=X572Mp_r46E","/watch?v=udxZ9zkDzpo","/watch?v=IBGYRtVqVSM","/watch?v=SnJ_ZPply8w","/watch?v=LoQYw49saqc","/watch?v=5D3crqpClPY","/watch?v=OMGd3mAfl-0","/watch?v=tXFpJrlgd7A","/watch?v=N6voHeEa3ig","/watch?v=BGpzGu9Yp6Y","/watch?v=AkWXXGe49cw","/watch?v=YsunfX4FwHM","/watch?v=M79KsXmsvec","/watch?v=-MI3CKL4NMI","/watch?v=bcCRDPU-ME0","/watch?v=BuMBmK5uksg","/watch?v=yXPCp48nYGw","/watch?v=TBCXWdL7Wb8","/watch?v=CHekNnySAfM","/watch?v=y_GuZg_XdE4","/watch?v=fh6qXWmLprY","/watch?v=D4hAVemuQXY","/watch?v=xjoCnCaynCM"],"category":"Music","licence":"Standard YouTube License","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT4M39S","channelID":"UClmRsH5LqkYPU_hdp-20YXA","authorYTURL":"http://www.youtube.com/user/MusicMadeReal","authorGPlusURL":"https://plus.google.com/116444639334119922143","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}