{"key":"KrpTSIMA7wM","title":"A People's History Breakfast, Lunch and Dinner 1 - Documentary","description":"Porridge, scrambled eggs and a full English breakfast are as popular as ever, but we don't neccessarily eat them first thing in the morning \"To eat well in England you should have breakfast three times a day,\" said the writer William Somerset Maugham, who spent a large part of his life living in France, and clearly thought the only meal Brits did well in the late 19th century was breakfast. At the beginning of the 21st century, reports have the full British breakfast supposedly in decline as our kitchens are full of cornflakes, and our journeys to work lined with places to grab a coffee and a bagel. \"Breakfast menus have definitely seen a rise in dishes called things like 'proper porridge' and 'chef's granola',\" says Seb Emina, author of The Breakfast Bible. And marketeers clearly see the fryup as in need of promotion: this week is farmhouse breakfast week in the UK, and in two weeks' time, the charity Winston's Wish is having its own Great British brekkie week. We get the message: stop flirting with muffins and skinny lattes, or cappuccinos and croissants, and bring back the bacon. But hang on a minute. There's barely a restaurant without a properly packed breakfast menu these days. Restaurants such as Caravan and Canteen in London are putting breakfast at the centre of what they do and serving it for as long as they can. Maybe we still do eat breakfast, just in a more Maugham-like way. Emina has it that: \"the health-inspired decline of the full English never quite happens. There's too big a sentimental connection. It's the last uncomplicated repository of English patriotism, and it tastes really nice.\" \"Where and when we breakfast has definitely changed,\" says Bill Collison, founder of the eponymous Bill's, which does breakfast all day at its branches in Brighton and Lewes. \"People tend to save the big traditional fryup for the weekend, but during the week we get a lot of people who work from home coming in for a late breakfast or a business brunch or wanting scrambled eggs or bacon sandwiches before going out in the evening.\" The full English breakfast does what it says on the tin. It includes the full range of food groups and it has proper provenance. Introduced in Victorian times, its consumption peaked in the 50s, when roughly half the British population started their day with a traditional breakfast, albeit one that began to evolve almost immediately, with regional variations, such as the addition of potato cake in Ireland and haggis in Scotland. There is still a last bastion of breakfast at breakfast time -- the B&B. Medina Brock, who runs Brandy House farm on the Welsh/Shropshire border, says farmhouse breakfasts are a showcase for local food producers and regional diversity and are almost always taken up first thing. \"Ninety-nine per cent of our guests want a breakfast, and the beauty of the meal is that while the basic components are the same, it will always taste different, depending on where the food is produced.\" But increasingly, breakfast is extending and creeping up towards lunch or even dinner time. \"More and more dinner menus are adding what you could call \"breakfast in disguise\", says Seb Emina. \"Black pudding hash topped with a fried duck egg seems to me a pretty obvious Trojan horse. Maybe one day we'll drop the pretence.\" So perhaps Maugham was right and we should all be breakfasting three times a day. Personally, I think once is enough, but not necessarily first thing. I like mine best after an evening out, at the no-frills Market Diner in Brighton.","publishedDate":"Diterbitkan tanggal 18 Feb 2014","viewCount":52163,"noOfLikes":201,"noOfDislikes":4,"relatedURL":["/watch?v=tnCONUSB0tE","/watch?v=MEWiayPIc68","/watch?v=SZfKr1gb0w4","/watch?v=A-p_EMVkzGs","/watch?v=Plg-ZiWNst8","/watch?v=XXNIp524e0s","/watch?v=6tgrDoTk0cQ","/watch?v=tZ3JGxfHFCA&list=PLhWPThADPfuppG79EdD0LEuTBxzXTcI56","/watch?v=WtZh7ruOYMU","/watch?v=tZ3JGxfHFCA","/watch?v=PyQVjlE3zkU","/watch?v=HiHETttjfg0","/watch?v=Akqt1swvvoU","/watch?v=yDi5bSg4Sn0","/watch?v=slwgXXVXM3I","/watch?v=YPRV1h3CGQk","/watch?v=-hPX3vFsIH4","/watch?v=8n_vWOo_rBk","/watch?v=JXZ1dH7tJWw","/watch?v=ZcAd5H_VSo8","/watch?v=rNHyNJrgTic","/watch?v=Q3DmrqjtD1Y","/watch?v=xUlCbvs-NkE","/watch?v=Ius60pzgkx8","/watch?v=oVzJhlvtDms","/watch?v=9DIjQTavW6Y","/watch?v=OwxgaYHpXeY","/watch?v=PpwFsIw7z4c","/watch?v=MazI9dFA6ME","/watch?v=FyFeuJ9unUg","/watch?v=oMvSPMFqmz0","/watch?v=UnzBq3htsgE","/watch?v=e64eYdAYksg","/watch?v=a3AAsF462Oc","/watch?v=rV8JLQgBnCU","/watch?v=fDO8vZrODrE","/watch?v=VsgC9ojd0yI","/watch?v=w21oNLcOX9I","/watch?v=LEq_lAx3ssE","/watch?v=vEFScBZh-Iw"],"category":"","licence":"","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT58M53S","channelID":"UC9fWrEgSuQp5imx78FtniUg","authorYTURL":"http://www.youtube.com/user/thehistoryful1","authorGPlusURL":"","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}