{"key":"X42mQPBir8k","title":"Secret Billionaire: The Chuck Feeney Story - Documentary","description":"Chuck Feeney, self-made American Billionaire and Co-Founder of DFS, world's leading duty free luxury retailer, agrees to a rare on-screen interview concerning his life's secret devotion: a lifetime of awe-aspiring anonymous charity. An Irish-American born in New Jersey during the Great Depression, Feeney became a billionaire many times over in the Sixties and Seventies when he co-founded the Duty Free Shoppers Group. But instead of indulging himself in the usual nonsense, Feeney found that his vast wealth sat uneasily with him, and he has spent the past 25 years or so devising ways to give it away. What's more, he's done so anonymously. Until very recently, Feeney's backing of Atlantic Philanthropies has been a secret, and in this exclusive documentary, he talks for the first time ever about his remarkable life. For the past 30 years, Atlantic Philanthropies has donated vast sums to universities, research institutions, social programmes, community enterprises and charities across the globe, but Ireland has benefited from his generosity more than most -- to the tune of more than $1.2bn. Feeney worked tirelessly behind the scenes to move the Peace Process forward and to fund reconciliation and regeneration projects in the North; in the south, he spearheaded the drive to make Ireland a leading research and knowledge-based economy and, to date, has donated more than $750m to Irish universities. Until 1997, all of this was done on one condition: that Feeney's name never be disclosed, the beneficiaries sworn to secrecy about the donor's identity. In many ways, Feeney is at odds with the modern world of celebrity and mass communication. One of the wealthiest and best-connected people on the planet, he lives a low-profile, low-cost existence and has rejected the international jet-set lifestyle that his business partners enjoy. He wears a $15 watch, eats in diners and doesn't own a car. He refuses to be interviewed or photographed and, until very recently, has refused to allow his name to be mentioned in connection with any of the projects he has funded. The self-styled 'shabby philanthropist', now 78, has finally agreed to step out of the shadows to be interviewed by Richard Crowley. He has also allowed his family and closest allies to speak about his life and work. His motivation for coming forward, he says, is to inspire Ireland's wealthy elite into following his example of 'giving while living' - a message that seems all the more pertinent in these straightened times. In this hour-long documentary, Richard Crowley interviews not only Feeney but also some of the people whom his work has touched, from politicians and activists such as Bertie Ahern, Niall O'Dowd, loyalist Billy Hutchinson and Gerry Adams; to his business partners in the very earliest days of Duty Free Shopping, including multi-billionaire Alan Parker (worth $7.9bn today) and the lawyer (Harvey Dale) who helped him to realise his dream of giving it all away; plus the heads of many Irish universities and The Atlantic Philanthropies, his charitable foundation. As Feeney's charity now prepares to give away his last $3 billion, the modest philanthropist will hopefully give viewers some insight into what prompted him to swim against the privileged tide.","publishedDate":"Diterbitkan tanggal 19 Sep 2014","viewCount":6718,"noOfLikes":40,"noOfDislikes":2,"relatedURL":["/watch?v=KfhQop0SmCk","/watch?v=BhthTQBM3pw","/watch?v=WomNuhkV7VA","/watch?v=zyZw6WH7D2s","/watch?v=KgaRyHpv-VE","/watch?v=11CeqNdgNfc","/watch?v=oEmPGEqrdgI","/watch?v=oAaQTnCNo70","/watch?v=f7Bo6Byq7go","/watch?v=QF5oMOsu0As","/watch?v=xNn_SEPux1A","/watch?v=DqcR5lNf3Eo","/watch?v=fwf6KQnekHo","/watch?v=3sY3KEXJJ5g","/watch?v=jTR1-bFtvvw","/watch?v=A-p_EMVkzGs","/watch?v=pCmDR1S4iSs","/watch?v=vrl5PFB35Ec","/watch?v=CX261fWDJyw","/watch?v=8KDXgiHpGo0","/watch?v=eQiKvDnx25A","/watch?v=ABZ1paBiRvY","/watch?v=858_wjsmjbI","/watch?v=PyQVjlE3zkU","/watch?v=pW84rxGlJe4","/watch?v=sUQgQuhUvzk","/watch?v=OA3OJ8VrPwE","/watch?v=cPHT0nEoo64","/watch?v=IFaqBjwcC_0","/watch?v=LsbJs9743Ow","/watch?v=pNVUfp0TWcE","/watch?v=4S57_VkGkLo","/watch?v=BLDgue3cFps","/watch?v=id7_cadCD3o","/watch?v=7OWGUzTolYA","/watch?v=HO6iTBSzm5k","/watch?v=ZXAixPRJkIw","/watch?v=ez4rbj1AZGg","/watch?v=HquUL5twUQA","/watch?v=Er4Jv5aawL8"],"category":"","licence":"","comments":[],"latitude":0.0,"longitude":0.0,"duration":"PT56M2S","channelID":"UCPLFdyUh7AeeuQoVJFD0_NQ","authorYTURL":"http://www.youtube.com/user/Coubism","authorGPlusURL":"https://plus.google.com/117930254073985705747","isFamilyFriendly":true,"regionAllowed":"AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW","isPaid":false,"unlisted":false}